/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_lcd_1206a.c
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: LCD1206A底层驱动模块.c文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#include "drv_lcd_1206a.h"

/* LCD端口状态 */
#define LCD_PORT_STATE_HIGH 	(1)
#define LCD_PORT_STATE_LOW		(0)

STATIC sbit g_lcd1206_lcd_rs = LCD1206_RS;
STATIC sbit g_lcd1206_lcd_rw = LCD1206_RW;
STATIC sbit g_lcd1206_lcd_e = LCD1206_E;
	
STATIC pf_delay plcd_delay_fun = (void *)0;

/*******************************************************************************
** 功能描述: LCD1206A写指令
** 参数说明: cmd：要写入得指令(8Bit)
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_write_cmd(uint8_t cmd)
{	
	/* 读写前片选使能 */
	plcd_delay_fun(1);
	g_lcd1206_lcd_e = LCD_PORT_STATE_HIGH;
	
	/* 将LCD改为写指令状态 */
	g_lcd1206_lcd_rs = LCD_PORT_STATE_LOW;
	g_lcd1206_lcd_rw = LCD_PORT_STATE_LOW;
	LCD1206_D  = cmd;
	
	/* 读写完后关闭片选 */
	g_lcd1206_lcd_e = LCD_PORT_STATE_LOW;	
	
	return;
}

/*******************************************************************************
** 功能描述: lcd-1206写数据
** 参数说明: cmd：要写入得指令(8Bit)
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_write_data(uint8_t dt)
{	
	/* 读写前片选使能 */
	plcd_delay_fun(1);
	g_lcd1206_lcd_e  = LCD_PORT_STATE_HIGH;

	/* 将LCD改为读指令状态 */
	g_lcd1206_lcd_rs = LCD_PORT_STATE_HIGH;
	g_lcd1206_lcd_rw = LCD_PORT_STATE_LOW;
	LCD1206_D  = dt;
	
	/* 读写完后关闭片选 */
	g_lcd1206_lcd_e = LCD_PORT_STATE_LOW;	
	
	return;
}

/*******************************************************************************
** 功能描述: lcd-1206设置显示位置
** 参数说明: cmd：要写入得指令(8Bit)
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_set_pos(uint8_t size_x, uint8_t size_y)
{
	uint8_t address;
	
	if(size_y == LCD1206_FIRST_ROW)
	{
		address = 0x80 + size_x; // - - 第一行位置
	}
	else 
	{
		address = 0xc0 + size_x; // - - 第二行位置
	}
	
	drv_lcd_1206_write_cmd(address);
	plcd_delay_fun(1);
	return;
}

/*******************************************************************************
** 功能描述: lcd-1206显示字符, 若输入'0x38'，屏幕只打印'8'
** 参数说明: size_x：x坐标
             size_y：y坐标
			 dat: 写入数据
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_disp_char(uint8_t size_x, uint8_t size_y, uint8_t dat)
{
	drv_lcd_1206_set_pos(size_x, size_y);	
	drv_lcd_1206_write_data(dat);
}

/*******************************************************************************
** 功能描述: lcd-1206显示字符串
** 参数说明: size_x：x坐标
             size_y：y坐标
			 str: 写入数据
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_disp_str(uint8_t size_x, uint8_t size_y, uint8_t *str)
{
	drv_lcd_1206_set_pos(size_x, size_y);

	while(*str !='\0')
	{
		drv_lcd_1206_write_data(*str);
		str++;
	}
}

/*******************************************************************************
** 功能描述: 清空屏幕
** 参数说明: 无
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_clear(void)
{
	drv_lcd_1206_write_cmd(0x01);
}

/*******************************************************************************
** 功能描述: LCD1206A注册并初始化
** 参数说明: fun_delay: 注册结构体参数
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_lcd_1206_reg(pf_delay *fun)
{
	/* lcd-1206延时函数注册 */
	plcd_delay_fun = fun;
	
	/* LCD-1206初始化*/
	/* 多次写0x38保证液晶的可靠初始化*/
	drv_lcd_1206_write_cmd(0x38); // 设置8位格式，2行
	plcd_delay_fun(5);
	drv_lcd_1206_write_cmd(0x38);
	plcd_delay_fun(5);
	drv_lcd_1206_write_cmd(0x38);
	plcd_delay_fun(5);
	
	drv_lcd_1206_write_cmd(0x0C); // 整体显示，关光标，不闪烁
	drv_lcd_1206_write_cmd(0x06); // 设定输入方式，增量不移位
	
	
	/* 清除屏幕显示 */
	drv_lcd_1206_clear();

	return;
}

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
