/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_i2c.c
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: 模拟IIC模块.c文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#include "drv_i2c.h"

/* 端口状态 */
#define IIC_PORT_STATE_HIGH 	(1)
#define IIC_PORT_STATE_LOW		(0)

STATIC sbit g_i2c_scl = IIC_SCL;
STATIC sbit g_i2c_sda = IIC_SDA;

/*******************************************************************************
** 功能描述: I2C总线延时专用
** 参数说明: x:延时时间：x*1.085us 
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
static void drv_i2c_delay(uint8_t x)
{
	do{
		IIC_NOP;
		
	}while(--x);
	
	return;
}

/*******************************************************************************
** 功能描述: 启动I2C总线,即发送I2C起始条件
** 参数说明: 无
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_i2c_start(void)
{
	g_i2c_sda = IIC_PORT_STATE_HIGH;    /* 发送起始条件的数据信号 */
	drv_i2c_delay(1);
	g_i2c_scl = IIC_PORT_STATE_HIGH;
	drv_i2c_delay(5); 					/* 起始条件建立时间大于4.7us,延时 */   
	g_i2c_sda = IIC_PORT_STATE_LOW;    	/* 发送起始信号 */
	drv_i2c_delay(5);       			/* 起始条件锁定时间大于4μs */      
	g_i2c_scl=IIC_PORT_STATE_LOW;       /* 钳住I2C总线，准备发送或接收数据 */
	drv_i2c_delay(2);
	
	return;
}

/*******************************************************************************
** 功能描述: 结束I2C总线,即发送I2C结束条件
** 参数说明: 无
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_i2c_stop(void)
{
	g_i2c_sda = IIC_PORT_STATE_LOW;      	/* 发送结束条件的数据信号 */
	drv_i2c_delay(1);      			 	
	g_i2c_scl = IIC_PORT_STATE_HIGH;     	/* 发送结束条件的时钟信号 */
	drv_i2c_delay(5);						/* 结束条件建立时间大于4μs */
	g_i2c_sda = IIC_PORT_STATE_HIGH;      	/* 发送I2C总线结束信号 */
	drv_i2c_delay(4);
	
	return;
}

/*******************************************************************************
** 功能描述: 字节数据发送,发完后等待应答,并对此状态位进行操作
** 参数说明: date: 所发地址/数据(8Bit)
** 返回说明: 发送数据正常，ack=1; ack=0表示被控器无应答或损坏
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
uint8_t drv_i2c_send_byte(uint8_t date)
{
	uint8_t BitCnt = 0, ack = IIC_ACK_OK;
 
	/* 要传送的数据长度为8位 */
	for(; BitCnt<8; BitCnt++) 
    {
		/* 判断发送位 */
		if((date<<BitCnt) & 0x80)
		{	
			g_i2c_sda = IIC_PORT_STATE_HIGH;
		}
		else
		{
			g_i2c_sda=IIC_PORT_STATE_LOW;
		}
		
		/* 置时钟线为高，通知被控器开始接收数据位 */
		drv_i2c_delay(1);
		g_i2c_scl = IIC_PORT_STATE_HIGH;
		drv_i2c_delay(5);				/* 保证时钟高电平周期大于4μs */         
		g_i2c_scl = IIC_PORT_STATE_LOW; 
    }
    
	/*8位发送完后释放数据线，准备接收应答位*/
    drv_i2c_delay(2);
    g_i2c_sda = IIC_PORT_STATE_HIGH;    
	drv_i2c_delay(2);   
    g_i2c_scl = IIC_PORT_STATE_HIGH;
	drv_i2c_delay(3);
	
	/* 判断是否接收到应答信号 */
    if(g_i2c_sda == IIC_PORT_STATE_HIGH)
	{
		ack = IIC_ACK_ERR;
	}		
	
    g_i2c_scl = IIC_PORT_STATE_LOW;
	drv_i2c_delay(2);
	
	return ack;
}
   
/*******************************************************************************
** 功能描述: 字节数据接收,用来接收从器件传来的数据,
             并判断总线错误(不发应答信号),发完后请用应答函数应答从机
** 参数说明: 无 
** 返回说明: retc:数据(8Bit)
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
uint8_t drv_i2c_rev_byte(void)
{
	uint8_t retc = 0, BitCnt = 0;
  
	/*置数据线为输入方式*/
	g_i2c_sda = IIC_PORT_STATE_HIGH;                
  
	for(; BitCnt<8; BitCnt++)
	{
        drv_i2c_delay(1);          
        g_i2c_scl=0;           /* 置时钟线为低，准备接收数据位 */
        drv_i2c_delay(5);      /* 时钟低电平周期大于4.7μs */
        g_i2c_scl=1;           /* 置时钟线为高使数据线上数据有效 */
		drv_i2c_delay(2);
		  
		/*读数据位,接收的数据位放入retc中 */
        retc <<= IIC_PORT_STATE_HIGH;
        if(g_i2c_sda == IIC_PORT_STATE_HIGH)
		{
			retc += 1;
			drv_i2c_delay(2); 
		}
	}

    g_i2c_scl = IIC_PORT_STATE_LOW;
	drv_i2c_delay(2);

	return retc;
}

/*******************************************************************************
** 功能描述: 主控器进行应答信号(可以是应答或非应答信号，由位参数a决定)
** 参数说明: 无 
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 新作
**------------------------------------------------------------------------------
********************************************************************************/
void drv_i2c_ack(uint8_t ack)
{
	/*在此发出应答或非应答信号 */
	if(ack)
	{
		g_i2c_sda = IIC_PORT_STATE_LOW;
	}          
	else
	{
		g_i2c_sda = IIC_PORT_STATE_HIGH;
	}
	
	drv_i2c_delay(3);      
	g_i2c_scl = IIC_PORT_STATE_HIGH;
	drv_i2c_delay(5);	/*时钟低电平周期大于4μs*/

	/*清时钟线，钳住I2C总线以便继续接收 */
	g_i2c_scl = IIC_PORT_STATE_LOW;                     
	drv_i2c_delay(2); 

	return;
}

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
