/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_lcd_1206a.c
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: 矩阵键盘底层驱动模块.c文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#include "drv_key_matrix.h"


/*******************************************************************************
** 功能描述: 获取机舱类型和机舱号
** 参数说明: mold:机舱类型
**           cabin:机舱号
** 返回说明: 无
** 创建人员: Andy
** 创建日期: 2021/4/03 14:45
**------------------------------------------------------------------------------
** 修改人员: wxd
** 修改日期: 2021/4/04
** 修改描述: 
** 按键接口 (KEY_PORT)  S1  S2  S3  S4  S5 ---------p16[头等舱]
**                      S6  S7  S8  S9  S10---------p15[经济舱]
**                      |    |   |   |   |
**                      p10  p11 p12 p13 p14
**                    [1舱][2舱][3舱][4舱][5舱]
**------------------------------------------------------------------------------
********************************************************************************/
void drv_keyboard_getval(uint8_t* mold, uint8_t* cabin)
{
	uint8_t count = 0;

	*mold  = 0;	
	*cabin = 0;

	/* 获取按键值 */
	KEY_BOARD_PORT=0x1F;
	if(KEY_BOARD_PORT!=0x1F)
	{
		/* 延时检测 */
		bsp_software_delay_ms(10);
		if(KEY_BOARD_PORT!=0x1F)
		{
			count = 0;
			
			/* 扫描列：哪个舱得座位号 */
			KEY_BOARD_PORT = 0x1F;
			switch(KEY_BOARD_PORT)
			{
				case 0X1e: *cabin = 1; break;
				case 0X1d: *cabin = 2; break;
				case 0X1b: *cabin = 3; break;
				case 0X17: *cabin = 4; break;
				case 0X0f: *cabin = 5; break;
				default:   *cabin = 0; break;
			}
			
			/* 扫描行：扫描舱号 */
			KEY_BOARD_PORT = 0X60;
			switch(KEY_BOARD_PORT)
			{
				case 0X40: *mold = CLASS_BUSINESS;break; // 商务舱 0100
				case 0X20: *mold = CLASS_ECONOMY; break; // 经济舱 0010
				case 0x60: *mold = CLASS_BUSINESS;break; // 若是同时按下，则优先显示商务舱
				default:   *mold = CLASS_NONE;break; 
			}
			
			/* 检测按键松手检测 */
			while((count < 50) && (KEY_BOARD_PORT != 0X60))	 
			{
				bsp_software_delay_ms(10);
				count++;
			}
		}
	}
}

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
