/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: bsp.h
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: 底层驱动模块所有的h文件的汇总文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#ifndef _BSP_H_
#define _BSP_H_


/* 通过取消注释或者添加注释的方式
   控制是否包含底层驱动模块
 */
#include "sys.h"
#include "drv_i2c.h"
#include "drv_timer.h"
#include "drv_lcd_1206a.h"
#include "drv_ad_pcf8591.h"
#include "drv_key_matrix.h"

/* 提供给其他C文件调用的函数 */
void bsp_Init(void);

#endif

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
