/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_i2c.h
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: 模拟IIC模块.h文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#ifndef _DRV_I2C_H_
#define _DRV_I2C_H_

/* 系统库文件 */
#include "sys.h"

/* IIC端口定义 */
#define IIC_SCL 			P2^0		/* I2C 时钟 */
#define IIC_SDA			P2^1		/* I2C 数据 */

/* 定义空指令 */
/* 说明： 【延时时间 = 12*1/晶振 = xus】 ≈ 1.085us              */
/* nop_()延时一个指令周期, 51单片机一个指令周期包括12个时钟周期 */   
#define	IIC_NOP  		_nop_()   	

/* IIC应答状态 */
#define IIC_ACK_OK 			(1)
#define IIC_ACK_ERR			(0)

/* 提供给其他C文件调用的函数 */
void drv_i2c_start(void);
void drv_i2c_stop(void);
uint8_t drv_i2c_send_byte(uint8_t date);
uint8_t drv_i2c_rev_byte(void);
void drv_i2c_ack(uint8_t ack);

#endif

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
