/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_i2c.h
** 创建人员: Andy
** 创建日期: 2021/4/03 15:40
** 文档描述: 矩阵键盘底层驱动模块.h文件
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#ifndef _DRV_KEY_MATRIX_H_
#define _DRV_KEY_MATRIX_H_

/* 系统库文件 */
#include "sys.h"

/* 矩阵键盘端口 */
#define KEY_BOARD_PORT		P1

/* 机舱类型  */
enum CABIN_TYPE
{
	CLASS_NONE = 0,  
	CLASS_ECONOMY ,   /* 经济舱 */ 
	CLASS_BUSINESS,   /* 商务舱 优先级较高 */
};

/* 自定义机舱号类型 */


/* 提供给其他C文件调用的函数 */
void drv_keyboard_getval(uint8_t* mold, uint8_t* cabin);

#endif

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
