/********************************Copyright (c)**********************************
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                      		 XXXXXXXXX有限公司
**                           
**
**----------------------------------文件信息------------------------------------
** 文件名称: drv_timer.h
** 创建人员: Andy
** 创建日期: 2021/04/28 15:40
** 文档描述: 定时器模块
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.0.0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
*/
#ifndef __DRV_TIMER_H_
#define __DRV_TIMER_H_

/* 系统库文件 */
#include "sys.h"

/* 10ms timer calculation method in 12T mode */
#define T1MS (65536-MAIN_Fosc/12/1000) 

/* 提供给其他C文件调用的函数 */
void bsp_start_time(void);
uint8_t bsp_get_time_1s_sta(void);

#endif

/*------------------------------------By_Andy_2021/4/03 15:35------------------------------*/
/*-----------------------------------------------------------------------------------------*/
